
import torch
import torchvision.models as models
import torchvision.transforms as transforms
from PIL import Image


labels = ['가래떡', '가츠동', '갈비구이', '갈비찜', '갈비탕', '감', '감귤주스', '감자구이', '감자그라탕', '감자샐러드', '감자칩', '감자튀김', '거봉포도', '건자두', '건크랜베리', '건포도', '게맛살', '게장', '고구마', '고등어구이', '고로케', '고르곤졸라피자', '고추', '고추장아찌', '골드키위', '곶감', '과일주스', '과일채소샐러드', '과일통조림', '국수', '군고구마', '군만두', '그라탕', '김', '김밥', '김치국', '김치볶음밥', '김치찌개', '까르보나라', '깐풍기', '나시고랭', '낚지볶음', '낫또', '냉면', '노랑파프리카', '녹색피망', '누텔라', '다크초콜릿', '단호박', '달걀', '달걀말이', '달걀볶음밥', '달걀비빔밥', '달걀샌드위치', '달걀찜', '달걀후라이', '닭가슴살구이', '닭가슴살샐러드', '닭갈비구이', '닭강정', '닭고기볶음', '닭찜', '닭훈제구이', '당근', '당근주스', '데리야끼치킨', '도넛', '돼지갈비찜', '돼지고기구이', '돼지고기볶음', '돼지고기스테이크', '된장국', '된장찌개', '두부', '두유', '등심스테이크', '딸기', '딸기라떼', '딸기아이스크림', '떡국', '떡만두국,고기만두', '떡볶이', '라떼', '라멘', '라면', '라자냐', '랍스타', '레드와인', '레모네이드', '로메인상추', '롤케이크', '리조또', '마늘장아찌', '마들렌', '마르게리타피자', '마른오징어', '마시멜로우', '마카로니샐러드', '마카롱', '막걸리', '만두', '만두국', '망고', '맥주', '머핀', '메쉬드포테이토', '멜론', '명란젓', '모듬초밥', '모듬회', '무김치', '문어', '미소장국', '미역국', '미역나물', '미트볼', '밀감', '밀크초콜릿', '바게트빵', '바나나', '바나나우유', '바나나칩', '바닐라아이스크림', '바베큐치킨', '밤', '밥', '방울토마토', '배추', '배추김치', '백도', '버섯 장아찌', '베이글', '베이글샌드위치', '베이컨구이', '베이컨피자', '보쌈', '복숭아', '볶음면', '볶음밥', '봉골레파스타', '부대찌개', '부침개', '북어국', '붕어빵', '브라우니', '브로콜리', '블랙커피', '블루베리', '비빔국수', '비빔냉면', '비빔밥', '비엔나소시지', '뻥튀기', '사과', '사과주스', '사과파이', '사이다', '삶은달걀', '삼겹살', '삼겹살구이', '삼계탕', '상추', '새우', '새우구이', '새우만두', '새우볶음밥', '새우튀김', '샌드위치', '생과일주스', '생맥주', '생선구이', '생선초밥', '생선튀김', '생선회', '생크림케이크', '석류', '셀러리', '소고기육포', '소시지구이', '송편', '쇠고기구이', '쇠고기볶음', '수박', '수박주스', '순대', '순대국밥', '순대볶음', '순살찜닭', '순살치킨', '쉐이크', '슈크림', '스크램블드에그', '스테이크', '스파게티', '스프', '슬라이스치즈', '시금치', '시루떡', '시리얼', '시리얼바', '시저샐러드', '쌀과자', '쌀국수', '쌀밥', '아귀찜', '아몬드', '아보카도', '아보카도샐러드', '아오리사과', '아이스라떼', '아이스크림', '아이스티', '아포가토', '안심스테이크', '알로에주스', '액상요구르트', '야끼소바', '야채볶음', '양꼬치', '양념치킨', '양배추', '양배추쌈', '양상추샐러드', '양주', '양파', '어묵탕', '에그타르트', '연어구이', '연어롤', '연어샐러드', '연어초밥', '연어회', '오렌지', '오렌지주스', '오리구이', '오므라이스', '오븐구이치킨몸통', '오이', '오이김치', '오이피클', '오징어튀김', '오코노미야끼', '오트밀', '와인', '와플', '왕돈가스', '왕만두', '요구르트', '우동', '우유', '육포', '육회', '자두', '자몽', '자몽주스', '잡채', '장어구이', '장어덮밥', '장어초밥', '전복', '절임배추', '젤리', '조미김', '족발', '주먹밥', '주스', '죽', '짜장면', '짬뽕', '쨈빵', '쪽갈비구이', '쭈꾸미볶음', '찐빵', '참외', '참치샌드위치', '참치통조림', '참치회', '찹쌀떡', '채소주스', '천도복숭아', '청포도', '체다치즈', '체리', '초밥', '초코머핀', '초코바', '초코아이스크림', '초코우유', '초코케이크', '초코쿠키', '초콜릿', '추어탕', '츄러스', '치즈볼', '치즈스틱', '치즈피자', '치킨', '치킨너겟', '치킨카레', '카레라이스', '카페라떼', '카페모카, 휘핑크림', '카푸치노', '카프레제샐러드', '캐러멜마끼아또', '캘리포니아롤', '커피', '컵라면', '케이크', '코코아', '콤비네이션피자', '콩국수', '콩나물', '쿠키', '크래커', '크레페', '크로와상', '크림치즈', '크림파스타', '키위', '타코야키', '탄산음료', '토마토', '토마토파스타소스', '토스트', '통밀빵', '티라미수', '파스타', '파인애플', '파전', '파프리카', '팝콘', '팟타이', '팥빙수', '팥죽', '팽이버섯', '페퍼로니피자', '펜네파스타', '포도', '폭립', '푸딩', '풋고추', '프레즐', '프렌치토스트', '피망', '피스타치오', '피자', '하와이안피자', '한라봉', '할라피뇨피클', '함박스테이크', '핫도그', '핫윙', '핫초코', '핫케이크', '해물덮밥', '해물찜', '해물탕', '해바라기씨', '해삼', '해시브라운', '해장국', '햄', '햄샌드위치', '호두', '호두과자', '호두파이', '호밀빵', '호박씨', '화덕피자', '화이트와인', '회오리감자', '후라이드치킨', '후랑크소시지', '후렌치후라이', '훈제연어', '훈제오리', '훈제오리샐러드', '흰죽']

# init - resnet50
model = models.resnet50(pretrained=False)
num_classes = 379
weight_path = './model/ResNet50.pth'

model.fc = torch.nn.Linear(2048, num_classes)
checkpoint = torch.load(weight_path, map_location=torch.device('cpu'))
model.load_state_dict(checkpoint['model'])
model.eval()

# init - transform
transform = transforms.Compose([
    transforms.Resize(256),
    transforms.ToTensor(),
])


def inference(input_image):
    input_image = Image.open(input_image).convert('RGB')
    input_data = transform(input_image).unsqueeze(0)
    with torch.no_grad():
        output = model(input_data)
    
    predicted_classes = torch.sigmoid(output)
    top_5_values, top_5_indices = torch.topk(predicted_classes, k=5)
    print(top_5_values)
    print(top_5_indices)
    result = {"food" : []}
    for i in top_5_indices[0]:
        result["food"].append(labels[i])

    return result

def get_classes():
    return {"class" : labels}

